app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "MyString"], ["email", "MyString"], ["created_at", 2016-10-02 23:29:24 UTC], ["updated_at", 2016-10-02 23:29:24 UTC]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save